#include "lib.h"
#include "channel.h"




/*===================================================
                配置文件
====================================================*/

/*===================================================
                宏，类型
====================================================*/

/*仓道充电宝编号是否为NULL*/
const U8 null_id[10] = {0,0,0,0,0,0,0,0,0,0};
#define channel_id_is_not_null(id) buffer_cmp((U8*)null_id,id,10);

/*===================================================
                本地函数
====================================================*/

/*获取仓道数据*/
static Channel*channel_data_get(U8 channel)
{
	return NULL;
}

/*===================================================
                全局函数
====================================================*/
/*仓道运行状态*/
void channel_state_check(Channel*ch)
{


}

/*仓道告警*/
void channel_warn_check(Channel*ch)
{

}


/*仓道错误*/
void channel_error_check(Channel*ch)
{

}

