
/*===================================================
功能:与仓道操作相关函数
====================================================*/
#include "lib.h"
#include "channel.h"

/*===================================================
                配置文件
====================================================*/

/*===================================================
                宏，类型
====================================================*/
/*仓道充电宝编号是否为NULL*/
const U8 null_id[10] = {0,0,0,0,0,0,0,0,0,0};
#define channel_id_is_not_null(id) buffer_cmp((U8*)null_id,id,10);

 Channel chs[5];
/*===================================================
                本地函数
====================================================*/

/*获取仓道数据*/
static Channel*channel_data_get(U8 channel)
{
	return NULL;
}

/*===================================================
                全局函数
====================================================*/
/*----------------------------------
仓道运行状态
仓道告警
仓道错误
-----------------------------------*/
void channel_state_check(Channel*ch)
{


}

void channel_warn_check(Channel*ch)
{

}

void channel_error_check(Channel*ch)
{

}

/*----------------------------------
仓道充电
仓道断电
-----------------------------------*/
void channel_charge(Channel*ch)
{


}
void channel_discharge(Channel*ch)
{
  //仓道断电 
	
	//从排队的列表中删除本仓道
	queue_delete(ch);
}