#include "includes.h"
/*===================================================
                本地函数
====================================================*/

/*充电宝进入通道状态机*/
static void charge_fsm(U8 channel,void*arg)
{
	FSM*fsm;
	Channel*ch;	
  fsm_time_set(time(0));//状态机时间

	Start(充电宝进入){
		
				
	}
	
	State(识别充电宝)
	{
    //能识别-->停止充电
		//不能识别->充电5秒
	}
	
	State(充电5秒)
	{
	
		//申请充电
		
		//等待5秒后，停止充电-->再一次识别充电宝
		
	}
	State(再一次识别充电宝)
	{
	  //能识别-->电量是否为0
		
		//不能识别-->上报数据 并跳到 检测充电宝进入 重新开始
	
	}
	
	State(电量是否为0)
	{
		//电量<=0-->申请充电
		
		//电量 >0-->停止充电
		
	}
	
	State(充电10分钟)
	{
	  //申请充电
		
		//电量 >0 或 超时10分钟-->停止充电

	}
	
	State(停止充电)
	{
	  //排队充电
		goto 充电7小时;
	}
	
	State(充电7小时)
	{
		
		//申请充电
		
//		//已经充电
//		if(queue_isok(ch)==1)
//		{
//			//输出5V
//		
//			//已经充电7小时->补偿充电
//			
//			//电流<200mA,待续120秒->补偿充电
//			
//		}else{
//			
//		  //挂起计时
//			
//			//不输出5V
//		}
		
	}
	
	State(补偿充电)
	{
	  //电量>95%:充电完成
		//电量>=85%,<=95%:1小时补充1次，3次机会
		//电量<85%,3小时补充一次，无限机会
	
	}
  Default()
		
}

/*===================================================
                全局函数
====================================================*/
AUTOSTART_THREAD_WITH_TIMEOUT(insert)
{
	PROCESS_BEGIN();
	while(1)
	{
		os_delay(insert,10);
	}
	PROCESS_END();
}

